tranminhhuu/KLTN_Source_Git/nrf5SDKforMeshv310src/examples/light_switch/provisioner/src/node_setup.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdarg.h>
#include <math.h>

#include "nrf_mesh_utils.h"
#include "device_state_manager.h"
#include "timer_scheduler.h"

#include "config_client.h"
#include "config_server.h"
#include "access_config.h"
#include "generic_level_server.h"
#include "generic_level_client.h"
#include "generic_onoff_server.h"
#include "generic_onoff_client.h"
#include "health_common.h"

#include "provisioner_helper.h"
#include "node_setup.h"
#include "example_common.h"
#include "example_network_config.h"
#include "light_switch_example_common.h"
#include "mesh_app_utils.h"

#include "log.h"
#include "nrf_mesh_assert.h"

//static bool tqt_check_first_server = false;
/* USER_NOTE: Add more steps here is you want to customize the nodes further. */
/* Node setup steps */
typedef enum
{
    NODE_SETUP_IDLE,
    NODE_SETUP_CONFIG_COMPOSITION_GET,
    NODE_SETUP_CONFIG_APPKEY_ADD,
    NODE_SETUP_CONFIG_APPKEY_BIND_HEALTH,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT,
    NODE_SETUP_CONFIG_PUBLICATION_HEALTH,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_RELAY,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER2,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER3,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER4,        // tqt edit 12032019
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT1,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT2,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_RELAY,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER2,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER3,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER4,       // tqt edit 12032019
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER_LOCK,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER_LOCK_P,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT_LOCK,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_LOCK,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_LOCK_P,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_LOCK,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_LOCK_P,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT_LOCK,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER_RM,        // tqt edit 12032019
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_RM,        // tqt edit 12032019
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_RM,       // tqt edit 12032019
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER_LOCK_MESH_STT,          // tqt edit 12032019
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_LOCK_MESH_STT,                // tqt edit 12032019
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_LOCK_MESH_STT,            // tqt edit 12032019
    NODE_SETUP_DONE,
} config_steps_t;

/* Structure to hold the composition data */
typedef struct
{
    uint16_t    len;
    struct
    {
        uint8_t page_number;
        uint8_t data[NRF_MESH_SEG_PAYLOAD_SIZE_MAX];
    }composition;
} composition_data_t;

/* Expected status structure, used for setup state machine */
typedef struct
{
    uint8_t  num_statuses;
    uint16_t expected_opcode;
    const access_status_t  * p_statuses;
} expected_status_list_t;

typedef struct
{
    uint8_t count;
    timer_event_t timer;
} client_send_retry_t;

typedef enum
{
    STATUS_CHECK_PASS,
    STATUS_CHECK_FAIL,
    STATUS_CHECK_UNEXPECTED_OPCODE
} status_check_t;

/* USER_NOTE:
You can define one or more such configuration steps for a given node in your network. The choice
of the steps can be done in @ref setup_select_steps() function.
*/
/* Sequence of steps for the client nodes */
static const config_steps_t client_config_steps[] =
{
    NODE_SETUP_CONFIG_COMPOSITION_GET,
    NODE_SETUP_CONFIG_APPKEY_ADD,
    NODE_SETUP_CONFIG_APPKEY_BIND_HEALTH,
    NODE_SETUP_CONFIG_PUBLICATION_HEALTH,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER_RM,        // tqt edit 12032019
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT1,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT2,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_RM,        // tqt edit 12032019
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_RM,       // tqt edit 12032019
    NODE_SETUP_DONE
};

/* Sequence of steps for the server nodes */
static const config_steps_t server_config_steps[] =
{
    NODE_SETUP_CONFIG_COMPOSITION_GET,
    NODE_SETUP_CONFIG_APPKEY_ADD,
    NODE_SETUP_CONFIG_APPKEY_BIND_HEALTH,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER,
    NODE_SETUP_CONFIG_PUBLICATION_HEALTH,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER,
    NODE_SETUP_DONE
};
//tqt edit
static const config_steps_t tqt_server_config_steps_for_relay[] =                 // config cho cac node Server subscribe vao 2 Group address
{
    NODE_SETUP_CONFIG_COMPOSITION_GET,
    NODE_SETUP_CONFIG_APPKEY_ADD,
    NODE_SETUP_CONFIG_APPKEY_BIND_HEALTH,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_RELAY,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_RELAY,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_RELAY,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_RELAY,        // tqt edit 12032019
    NODE_SETUP_CONFIG_PUBLICATION_HEALTH,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_RELAY,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_RELAY,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_RELAY,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_RELAY,       // tqt edit 12032019
    NODE_SETUP_DONE
};

static const config_steps_t tqt_server_config_steps_for_end_node[] =               // (Node khoa cua) config cho cac node Server subscribe vao Client model address va public cho provisioner
{
    NODE_SETUP_CONFIG_COMPOSITION_GET,
    NODE_SETUP_CONFIG_APPKEY_ADD,
    NODE_SETUP_CONFIG_APPKEY_BIND_HEALTH,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER_LOCK,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER_LOCK,
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER_LOCK,          // tqt edit 12032019
    NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT_LOCK,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_LOCK,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_LOCK,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_LOCK,                // tqt edit 12032019
    NODE_SETUP_CONFIG_PUBLICATION_HEALTH,
    NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT_LOCK,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_LOCK,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_LOCK,
    NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_LOCK,            // tqt edit 12032019
    NODE_SETUP_DONE
};
//tqt edit

static uint16_t m_current_node_addr;
static uint16_t m_retry_count;
static client_send_retry_t m_send_timer;
static const uint8_t * mp_appkey;
static uint16_t m_appkey_idx;
static access_model_id_t m_client_model_id;
static access_model_id_t m_server_model_id;
static uint16_t tqt_last_element;
tqt_node_state_ tqt_online_node_state[MAX_NODE_IN_MESH] = {0};
int8_t index_online = -1;
int8_t index_offline = -1;
uint16_t update_node_state_to_cloud = 0;
uint16_t re_config_addr = 0;
int8_t wait_for_check = 0;
bool tqt_state_network_update = false;
char tqt_network_state_str[10] = {'\0'};
static const config_steps_t m_idle_step = NODE_SETUP_IDLE;
static const config_steps_t * mp_config_step = &m_idle_step;
static node_setup_successful_cb_t m_node_setup_success_cb;
static node_setup_failed_cb_t m_node_setup_failed_cb;
static expected_status_list_t m_expected_status_list;
char tqt_endline[2] = "\n";
int8_t number_of_node_current = 0;
uint8_t counter_node_signal_index = 0;
int16_t addr_of_node_model_alive[MAX_MODEL_ADDRESS_FEEDBACK_SCAN] = {0};
//network_stats_data_stored_t m_nw_state;
//flash_manager_t m_flash_manager;
/* Forward declaration */
static void config_step_execute(void);

/*************************************************************************************************/

