tranminhhuu/KLTN_Source_Git/nrf5SDKforMeshv310src/examples/light_switch/provisioner/src/node_setup.c
    switch (*mp_config_step)
    {
        /* Read the composition data from the node: */
        case NODE_SETUP_CONFIG_COMPOSITION_GET:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Getting composition data\n");
            status = config_client_composition_data_get(0x00);

            expected_status_set(CONFIG_OPCODE_COMPOSITION_DATA_STATUS, 0, NULL);
            break;
        }

        /* Add the application key to the node: */
        case NODE_SETUP_CONFIG_APPKEY_ADD:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Adding appkey: 0x%04x \n",mp_appkey);
            __LOG_XB(LOG_SRC_APP, LOG_LEVEL_INFO, "TQT Adding appkey: ", mp_appkey, NRF_MESH_KEY_SIZE);
            status = config_client_appkey_add(NETKEY_INDEX, m_appkey_idx, mp_appkey);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS, ACCESS_STATUS_KEY_INDEX_ALREADY_STORED};
            expected_status_set(CONFIG_OPCODE_APPKEY_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }

        /* Bind the health server to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_HEALTH:
        {
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: Health server WITH m_current_node_addr :  0x%04x\n",m_current_node_addr);
            access_model_id_t model_id;
            model_id.company_id = ACCESS_COMPANY_ID_NONE;
            model_id.model_id = HEALTH_SERVER_MODEL_ID;
            uint16_t element_address = m_current_node_addr;
            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }

        /* Bind the On/Off client to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT:
        {
            if (model_element_addr == 0)
            {
                model_element_addr = m_current_node_addr + 1;
            }
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: 0x%04x client on element 0x%04x\n", m_client_model_id.model_id, model_element_addr);
            access_model_id_t model_id;
            model_id.company_id = m_client_model_id.company_id;
            model_id.model_id = m_client_model_id.model_id;
            uint16_t element_address = model_element_addr;
            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, ARRAY_SIZE(exp_status), exp_status);

            if (status == NRF_SUCCESS)
            {
                model_element_addr++;
            } 
            break;
        }

        /* Bind the On/Off server to the application key: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER:
        {
            if (tqt_model_element_addr == 0)
            {
                tqt_model_element_addr = m_current_node_addr + 0;
            }
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: 0x%04x server AND: 0x%04x AND: m_current_node_addr: 0x%04x\n", m_server_model_id.model_id,tqt_model_element_addr,m_current_node_addr);
            access_model_id_t model_id;
            model_id.company_id = m_server_model_id.company_id;
            model_id.model_id = m_server_model_id.model_id;
            uint16_t element_address = tqt_model_element_addr;
            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, ARRAY_SIZE(exp_status), exp_status);
            if (status == NRF_SUCCESS)
            {
                tqt_model_element_addr++;
                //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "tqt 517 tqt_model_element_addr: 0x%04x tqt_last_element: 0x%04x m_current_node_addr: 0x%04x\n", tqt_model_element_addr, tqt_last_element, m_current_node_addr);
                if(tqt_model_element_addr == tqt_last_element) {
                    tqt_model_element_addr = 0;
                    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "BIND SERVER OK, NEXT NODE\n");
                }
            }
            break;
        }
        
        /* tqt edit bind cho server model cua node khoa cua: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER_LOCK:         // tqt edit model server cua node khoa cua
        {

            if(tqt_config_appkey_bind_lock == 0) {
                tqt_config_appkey_bind_lock = m_current_node_addr;
            }
            //tqt_model_element_addr_lock = m_current_node_addr;
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: 0x%04x server AND: 0x%04x\n", m_server_model_id.model_id,tqt_config_appkey_bind_lock);
            access_model_id_t model_id;
            model_id.company_id = m_server_model_id.company_id;
            model_id.model_id = m_server_model_id.model_id;
            uint16_t element_address = tqt_config_appkey_bind_lock;
            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, ARRAY_SIZE(exp_status), exp_status);
            if (status == NRF_SUCCESS)
            {
                if (tqt_config_appkey_bind_lock == m_current_node_addr) {
                    tqt_config_appkey_bind_lock = m_current_node_addr  + ELEMENT_IDX_LOCK_SUB_PROVISIONER;
                } else {
                    tqt_config_appkey_bind_lock = tqt_config_appkey_bind_lock + 1;
                }
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Bind server LOCK OK\n");
            }
            break;
        }
        /* tqt edit bind cho client model cua node khoa cua: */
        case NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_CLIENT_LOCK:           // tqt edit model client cua node khoa cua
        {
            tqt_model_element_addr_lock = m_current_node_addr + ELEMENT_IDX_LOCK_PUB_PROVISIONER;
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: 0x%04x client on element 0x%04x\n", m_client_model_id.model_id, tqt_model_element_addr_lock);
            access_model_id_t model_id;
            model_id.company_id = m_client_model_id.company_id;
            model_id.model_id = m_client_model_id.model_id;
            uint16_t element_address = tqt_model_element_addr_lock;
            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);

