tranminhhuu/KLTN_Source_Git/nrf5SDKforMeshv310src/examples/light_switch/provisioner/src/node_setup.c
            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, ARRAY_SIZE(exp_status), exp_status);

            if (status == NRF_SUCCESS)
            {
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Bind client Lock OK\n");
            }
            break;
        }


        case NODE_SETUP_CONFIG_APPKEY_BIND_ONOFF_SERVER_RM:         // tqt edit 12032019 model server cua node Remote
        {
            tqt_model_element_addr_lock = m_current_node_addr  + ELEMENT_IDX_REMOTE_SUB_PRO_MESH_STT;
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "App key bind: 0x%04x server AND: 0x%04x\n", m_server_model_id.model_id,tqt_model_element_addr_lock);
            access_model_id_t model_id;
            model_id.company_id = m_server_model_id.company_id;
            model_id.model_id = m_server_model_id.model_id;
            uint16_t element_address = tqt_model_element_addr_lock;
            status = config_client_model_app_bind(element_address, m_appkey_idx, model_id);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_APP_STATUS, ARRAY_SIZE(exp_status), exp_status);
            if (status == NRF_SUCCESS)
            {
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Bind server REMOTE subscribe PROVISIONER OK\n");
            }
            break;
        }

        /* Configure the publication parameters for the Health server: */
        case NODE_SETUP_CONFIG_PUBLICATION_HEALTH:
        {
            config_publication_state_t pubstate = {0};
            pubstate.element_address = m_current_node_addr;
            pubstate.publish_address.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
            pubstate.publish_address.value = PROVISIONER_ADDRESS;
            pubstate.appkey_index = 0;
            pubstate.frendship_credential_flag = false;
            pubstate.publish_ttl = (SERVER_NODE_COUNT > NRF_MESH_TTL_MAX ? NRF_MESH_TTL_MAX : SERVER_NODE_COUNT);
            pubstate.publish_period.step_num = 1;
            pubstate.publish_period.step_res = ACCESS_PUBLISH_RESOLUTION_10S;         // tqt edit: 
            pubstate.retransmit_count = 1;
            pubstate.retransmit_interval = 0;
            pubstate.model_id.company_id = ACCESS_COMPANY_ID_NONE;
            pubstate.model_id.model_id = HEALTH_SERVER_MODEL_ID;
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Setting publication address for the health server to 0x%04x\n", pubstate.publish_address.value);
            status = config_client_model_publication_set(&pubstate);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }

        // Server model 1 subscribe to ODD nen phai public vo ELEMENT_IDX_ONOFF_CLIENT2, con Server model 2 subscribe to EVEN nen phai public vo ELEMENT_IDX_ONOFF_CLIENT1
        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER:
        {
            config_publication_state_t pubstate = {0};
            pubstate.element_address = m_current_node_addr;
            pubstate.publish_address.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
          //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "TQT Run Public CLIENT 2: %d\n", UNPROV_START_ADDRESS + ELEMENT_IDX_ONOFF_CLIENT2);
            pubstate.publish_address.value = UNPROV_START_ADDRESS + ELEMENT_IDX_ONOFF_CLIENT2;
            pubstate.appkey_index = m_appkey_idx;
            pubstate.frendship_credential_flag = false;
            pubstate.publish_ttl = (SERVER_NODE_COUNT > NRF_MESH_TTL_MAX ? NRF_MESH_TTL_MAX : SERVER_NODE_COUNT);
            pubstate.publish_period.step_num = 0;
            pubstate.publish_period.step_res = ACCESS_PUBLISH_RESOLUTION_1S;
            pubstate.retransmit_count = 1;
            pubstate.retransmit_interval = 0;
            pubstate.model_id.company_id = m_server_model_id.company_id;
            pubstate.model_id.model_id = m_server_model_id.model_id;
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Set: 0x%04x server pub addr: 0x%04x\n", m_server_model_id.model_id, pubstate.publish_address.value);
            status = config_client_model_publication_set(&pubstate);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }
        
        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_RELAY:
        {
            if(tqt_config_publication_relay_step == 0) {
              tqt_config_publication_relay_step = m_current_node_addr + ELEMENT_IDX_RELAY_LOCK_SUB_REMOTE;
            }
            config_publication_state_t pubstate = {0};
            pubstate.element_address = tqt_config_publication_relay_step;
            pubstate.publish_address.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
                //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "TQT RELAY CONFIG PUBLIC: 0x%04x\n", tqt_config_publication_relay_step);

            if(tqt_config_publication_relay_step == (m_current_node_addr + ELEMENT_IDX_RELAY_LOCK_SUB_REMOTE)) {
                pubstate.publish_address.value = GROUP_ADDRESS_CLIENT_NODE;
            } else if(tqt_config_publication_relay_step == (m_current_node_addr + ELEMENT_IDX_RELAY_SUB_LOCK)) {
                pubstate.publish_address.value = GROUP_ADDRESS_TQT;
            } else if(tqt_config_publication_relay_step == (m_current_node_addr + ELEMENT_IDX_RELAY_SUB_PROVISIONER)) {
                pubstate.publish_address.value = GROUP_ADDRESS_TQT_CLOUD;
            } else if(tqt_config_publication_relay_step == (m_current_node_addr + ELEMENT_IDX_RELAY_SUB_PRO_MESH_STT)) {
                pubstate.publish_address.value = GROUP_ADDRESS_TQT_MESH_STATUS;
            } else {}
            pubstate.appkey_index = m_appkey_idx;
            pubstate.frendship_credential_flag = false;
            pubstate.publish_ttl = (SERVER_NODE_COUNT > NRF_MESH_TTL_MAX ? NRF_MESH_TTL_MAX : SERVER_NODE_COUNT);
            pubstate.publish_period.step_num = 0;
            pubstate.publish_period.step_res = ACCESS_PUBLISH_RESOLUTION_1S;
            pubstate.retransmit_count = 1;
            pubstate.retransmit_interval = 0;
            pubstate.model_id.company_id = m_server_model_id.company_id;
            pubstate.model_id.model_id = m_server_model_id.model_id;
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Set: 0x%04x server pub addr: 0x%04x\n", m_server_model_id.model_id, pubstate.publish_address.value);
            status = config_client_model_publication_set(&pubstate);

