tranminhhuu/KLTN_Source_Git/nrf5SDKforMeshv310src/examples/light_switch/provisioner/src/node_setup.c
            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            //tqt_config_publication_relay_step = tqt_config_publication_relay_step + 1;    // increase number of model address
            
            tqt_config_publication_relay_step++;
                //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "tqt 735 tqt_config_publication_relay_step: 0x%04x tqt_last_element: 0x%04x m_current_node_addr: 0x%04x\n", tqt_config_publication_relay_step, tqt_last_element, m_current_node_addr);
                if(tqt_config_publication_relay_step == tqt_last_element) {
                    tqt_config_publication_relay_step = 0;
                }

            break;
        }

        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_RM:           // tqt edit 12032019
        {
            config_publication_state_t pubstate = {0};
            pubstate.element_address = m_current_node_addr + ELEMENT_IDX_REMOTE_SUB_PRO_MESH_STT;
            pubstate.publish_address.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
                pubstate.publish_address.value = GROUP_ADDRESS_TQT_MESH_STATUS;         // address to listen to
            pubstate.appkey_index = m_appkey_idx;
            pubstate.frendship_credential_flag = false;
            pubstate.publish_ttl = (SERVER_NODE_COUNT > NRF_MESH_TTL_MAX ? NRF_MESH_TTL_MAX : SERVER_NODE_COUNT);
            pubstate.publish_period.step_num = 0;
            pubstate.publish_period.step_res = ACCESS_PUBLISH_RESOLUTION_1S;
            pubstate.retransmit_count = 1;
            pubstate.retransmit_interval = 0;
            pubstate.model_id.company_id = m_server_model_id.company_id;
            pubstate.model_id.model_id = m_server_model_id.model_id;
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Set: 0x%04x server pub addr: 0x%04x\n", m_server_model_id.model_id, pubstate.publish_address.value);
            status = config_client_model_publication_set(&pubstate);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }

        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_SERVER_LOCK:
        {

            if(tqt_config_publication_lock == 0) {
                tqt_config_publication_lock = m_current_node_addr + ELEMENT_IDX_RELAY_LOCK_SUB_REMOTE;
            }
            config_publication_state_t pubstate = {0};
            pubstate.element_address = tqt_config_publication_lock;
            pubstate.publish_address.type = NRF_MESH_ADDRESS_TYPE_UNICAST;
                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "TQT Run Public To Client Node: 0x%04x\n", UNPROV_START_ADDRESS + ELEMENT_IDX_ONOFF_CLIENT2);
            
            if(tqt_config_publication_lock == (m_current_node_addr + ELEMENT_IDX_RELAY_LOCK_SUB_REMOTE)) {
                pubstate.publish_address.value = GROUP_ADDRESS_CLIENT_NODE;
            } else if(tqt_config_publication_lock == ( m_current_node_addr + ELEMENT_IDX_LOCK_SUB_PROVISIONER)) {
                pubstate.publish_address.value = GROUP_ADDRESS_TQT_CLOUD; 
            } else if(tqt_config_publication_lock == (m_current_node_addr + ELEMENT_IDX_LOCK_SUB_PRO_MESH_STT)) {
                pubstate.publish_address.value = GROUP_ADDRESS_TQT_MESH_STATUS;
            }  else {}
            //pubstate.publish_address.value = UNPROV_START_ADDRESS + ELEMENT_IDX_ONOFF_CLIENT2;
            pubstate.appkey_index = m_appkey_idx;
            pubstate.frendship_credential_flag = false;
            pubstate.publish_ttl = (SERVER_NODE_COUNT > NRF_MESH_TTL_MAX ? NRF_MESH_TTL_MAX : SERVER_NODE_COUNT);
            pubstate.publish_period.step_num = 0;
            pubstate.publish_period.step_res = ACCESS_PUBLISH_RESOLUTION_1S;
            pubstate.retransmit_count = 1;
            pubstate.retransmit_interval = 0;
            pubstate.model_id.company_id = m_server_model_id.company_id;
            pubstate.model_id.model_id = m_server_model_id.model_id;
            __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Set: 0x%04x server pub addr: 0x%04x\n", m_server_model_id.model_id, pubstate.publish_address.value);
            status = config_client_model_publication_set(&pubstate);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            if (tqt_config_publication_lock == m_current_node_addr + ELEMENT_IDX_RELAY_LOCK_SUB_REMOTE) {
                tqt_config_publication_lock = m_current_node_addr  + ELEMENT_IDX_LOCK_SUB_PROVISIONER;
            } else {
                tqt_config_publication_lock = tqt_config_publication_lock + 1;
            }
            break;
        }
        /* Configure subscription address for the On/Off server */
        case NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER:
        {
            uint16_t element_address = m_current_node_addr + ELEMENT_IDX_RELAY_LOCK_SUB_REMOTE;
            nrf_mesh_address_t address = {NRF_MESH_ADDRESS_TYPE_INVALID, 0, NULL};
            address.type = NRF_MESH_ADDRESS_TYPE_GROUP;
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "TQT element_address in NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER1:0x%04x\n", element_address);
                      address.value  = GROUP_ADDRESS_CLIENT_NODE;
            access_model_id_t model_id;
            model_id.company_id = m_server_model_id.company_id;
            model_id.model_id = m_server_model_id.model_id;
            status = config_client_model_subscription_add(element_address, address, model_id);
            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }
        case NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_RELAY:
        {
            if (tqt_config_subscription_relay == 0) {
                tqt_config_subscription_relay = m_current_node_addr + ELEMENT_IDX_RELAY_LOCK_SUB_REMOTE;
            }
            nrf_mesh_address_t address = {NRF_MESH_ADDRESS_TYPE_INVALID, 0, NULL};
            address.type = NRF_MESH_ADDRESS_TYPE_GROUP;
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "TQT Relay Node Subscribe to Client node:0x%04x\n", element_address);   
                              
