tranminhhuu/KLTN_Source_Git/nrf5SDKforMeshv310src/examples/light_switch/provisioner/src/node_setup.c
            if(tqt_config_subscription_relay == (m_current_node_addr + ELEMENT_IDX_RELAY_LOCK_SUB_REMOTE)) {
                address.value = GROUP_ADDRESS_CLIENT_NODE;
            } else if(tqt_config_subscription_relay == (m_current_node_addr + ELEMENT_IDX_RELAY_SUB_LOCK)) {
                address.value = GROUP_ADDRESS_TQT;  
            } else if(tqt_config_subscription_relay == (m_current_node_addr + ELEMENT_IDX_RELAY_SUB_PROVISIONER)) {
                address.value = GROUP_ADDRESS_TQT_CLOUD;
            } else if(tqt_config_subscription_relay == (m_current_node_addr + ELEMENT_IDX_RELAY_SUB_PRO_MESH_STT)) {
                address.value = GROUP_ADDRESS_TQT_MESH_STATUS;
            } else {}
            access_model_id_t model_id;
            model_id.company_id = m_server_model_id.company_id;
            model_id.model_id = m_server_model_id.model_id;
            status = config_client_model_subscription_add(tqt_config_subscription_relay, address, model_id);
            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            //tqt_config_subscription_relay = tqt_config_subscription_relay + 1;
            tqt_config_subscription_relay++;
                if(tqt_config_subscription_relay == tqt_last_element) {
                    tqt_config_subscription_relay = 0;
                }
            break;
        }

        case NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_RM:            // tqt edit 12032019
        {
            uint16_t element_address = m_current_node_addr + ELEMENT_IDX_REMOTE_SUB_PRO_MESH_STT;
            nrf_mesh_address_t address = {NRF_MESH_ADDRESS_TYPE_INVALID, 0, NULL};
            address.type = NRF_MESH_ADDRESS_TYPE_GROUP;
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "TQT Relay Node Subscribe to Mesh network status request:0x%04x\n", element_address);                     
            address.value  = GROUP_ADDRESS_TQT_MESH_STATUS;
            access_model_id_t model_id;
            model_id.company_id = m_server_model_id.company_id;
            model_id.model_id = m_server_model_id.model_id;
            status = config_client_model_subscription_add(element_address, address, model_id);
            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }
        
        case NODE_SETUP_CONFIG_SUBSCRIPTION_ONOFF_SERVER_LOCK:
        {

            if(tqt_config_subscription_lock == 0) {
              tqt_config_subscription_lock = m_current_node_addr + ELEMENT_IDX_RELAY_LOCK_SUB_REMOTE;
            }
            nrf_mesh_address_t address = {NRF_MESH_ADDRESS_TYPE_INVALID, 0, NULL};
            address.type = NRF_MESH_ADDRESS_TYPE_GROUP;
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "TQT EndNode Subscribe to Client Node:0x%04x\n", tqt_config_subscription_lock);
            if(tqt_config_subscription_lock == (m_current_node_addr + ELEMENT_IDX_RELAY_LOCK_SUB_REMOTE)) {
                address.value = GROUP_ADDRESS_CLIENT_NODE;
            } else if(tqt_config_subscription_lock == ( m_current_node_addr + ELEMENT_IDX_LOCK_SUB_PROVISIONER)) {
                address.value = GROUP_ADDRESS_TQT_CLOUD;
            } else if(tqt_config_subscription_lock == (m_current_node_addr + ELEMENT_IDX_LOCK_SUB_PRO_MESH_STT)) {
                address.value = GROUP_ADDRESS_TQT_MESH_STATUS;
            }  else {}
            access_model_id_t model_id;
            model_id.company_id = m_server_model_id.company_id;
            model_id.model_id = m_server_model_id.model_id;
            status = config_client_model_subscription_add(tqt_config_subscription_lock, address, model_id);
            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            if (tqt_config_subscription_lock == m_current_node_addr + ELEMENT_IDX_RELAY_LOCK_SUB_REMOTE) {
                tqt_config_subscription_lock = m_current_node_addr  + ELEMENT_IDX_LOCK_SUB_PROVISIONER;
            } else {
                tqt_config_subscription_lock = tqt_config_subscription_lock + 1;
            }
            break;
        }

        // tqt edit config cho node server co the public GROUP_ADDRESS_TQT
        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT_LOCK:
        {
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "TQT Run Public GROUP_ADDRESS_TQT\n");
            config_publication_state_t pubstate = {0};
            client_pub_state_set(&pubstate,
                                 m_current_node_addr + ELEMENT_IDX_LOCK_PUB_PROVISIONER,
                                 GROUP_ADDRESS_TQT);
            status = config_client_model_publication_set(&pubstate);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }

        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT1:
        {
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "TQT Run Public CLIENT 1\n");
            config_publication_state_t pubstate = {0};
            client_pub_state_set(&pubstate,
                                 m_current_node_addr + ELEMENT_IDX_ONOFF_CLIENT1,
                                 GROUP_ADDRESS_CLIENT_NODE);
            status = config_client_model_publication_set(&pubstate);

            static const access_status_t exp_status[] = {ACCESS_STATUS_SUCCESS};
            expected_status_set(CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, ARRAY_SIZE(exp_status), exp_status);
            break;
        }

        case NODE_SETUP_CONFIG_PUBLICATION_ONOFF_CLIENT2:
        {
        //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "TQT Run Public CLIENT 2\n");
            config_publication_state_t pubstate = {0};
            client_pub_state_set(&pubstate,
                                 m_current_node_addr + ELEMENT_IDX_ONOFF_CLIENT2,
                                 GROUP_ADDRESS_EVEN);
            status = config_client_model_publication_set(&pubstate);

