tranminhhuu/KLTN_Source_Git/nrf5SDKforMeshv310src/examples/light_switch/provisioner/src/node_setup.c
void tqt_reset_nodes_state() {
//__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "index UART: %d number_of_node_current: %d\n",index_online, number_of_node_current);
    int length_of_arr = sizeof(tqt_online_node_state)/sizeof(tqt_node_state_);
    for(int i = 0; i <= number_of_node_current; i++) {
        tqt_online_node_state[i].active_state = OFFLINE;
    }
}

void tqt_update_node_online_again(uint16_t node_addr) {
//__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "index UART: %d number_of_node_current: %d\n",index_online, number_of_node_current);
       for(int i = 0; i <= number_of_node_current; i++) {
        if(tqt_online_node_state[i].node_model_addr == node_addr){
            //__LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Node: 0x%04X Is ONLINE AGAIN\n",node_addr-3);
            tqt_online_node_state[i].active_state = ONLINE;
            //tqt_reset_nodes_state(); 
            return;
        } else {continue;}
      }
}

bool tqt_update_add_uart_state() {
    int tqt_network_state = 0;
    char number_of_node_in_mesh[1] = {'\0'};
    swap_endnode_position();
    for(int i = 0; i <= number_of_node_current; i++) {
        if(tqt_online_node_state[i].active_state == ONLINE) {
            tqt_network_state = pow(10,i) + tqt_network_state;
        } else {
            tqt_network_state = 2*pow(10,i) + 0 + tqt_network_state;
        }
    } 
    memset(tqt_network_state_str,'\0',sizeof(tqt_network_state_str));
    sprintf(tqt_network_state_str,"%d",tqt_network_state);
    tqt_network_state = number_of_node_current + 1;
    sprintf(number_of_node_in_mesh,"%d",tqt_network_state);
    strcat(tqt_network_state_str,number_of_node_in_mesh);
    strcat(tqt_network_state_str,tqt_endline);
    return true;
}

//void pre_format_mesh_status() {

//    int position = 0;
//    int16_t after_sort[MAX_MODEL_ADDRESS_FEEDBACK_SCAN];
//    for(int i = 0; i < (counter_node_signal_index - 1); i++) {
//      for(int j = i+1; j < counter_node_signal_index; j++) {
//            if((addr_of_node_model_alive[j] == addr_of_node_model_alive[i]) && (addr_of_node_model_alive[j] != 0)) {
//            addr_of_node_model_alive[j] = 0;
//          }
//      }
//    }
//  
//    for(int j = 0; j < counter_node_signal_index; j++) {
//        if(addr_of_node_model_alive[j] != 0) {
//          dest[position] = addr_of_node_model_alive[j];
//          position++;
//        }
//    }

//    qsort(values, position, sizeof(int), cmpfunc_cb);
//
//}
